<?xml version="1.0"?>
<net name="tokenizer" version="11">
	<layers>
		<layer id="0" name="Parameter_91568" type="Parameter" version="opset1">
			<data shape="?" element_type="string" />
			<output>
				<port id="0" precision="STRING" names="Parameter_91568">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Constant_91574" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="0" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="2" name="StringTensorUnpack_91569" type="StringTensorUnpack" version="opset15">
			<input>
				<port id="0" precision="STRING">
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="3" precision="U8">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="ShapeOf_91570" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Constant_91571" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="0" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="5" name="Constant_91572" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="0" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="6" name="Gather_91573" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" />
			</output>
		</layer>
		<layer id="7" name="Constant_91575" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="8" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="8" name="Range_91576" type="Range" version="opset4">
			<data output_type="i32" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I32">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Constant_91577" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="8" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="10" name="Constant_91578" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="8" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="11" name="Add_91579" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" />
			</output>
		</layer>
		<layer id="12" name="Constant_91580" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="8" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="13" name="Range_91581" type="Range" version="opset4">
			<data output_type="i32" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I32">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Constant_91643" type="Const" version="opset1">
			<data element_type="u8" shape="444" offset="16" size="444" />
			<output>
				<port id="0" precision="U8">
					<dim>444</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="SpecialTokensSplit_91644" type="SpecialTokensSplit" version="extension">
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="3" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="4" precision="U8">
					<dim>-1</dim>
				</port>
				<port id="5" precision="U8">
					<dim>444</dim>
				</port>
			</input>
			<output>
				<port id="6" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="7" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="8" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="9" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="10" precision="U8">
					<dim>-1</dim>
				</port>
				<port id="11" precision="BOOL">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="CharsMapNormalization_91645" type="CharsMapNormalization" version="extension">
			<data add_dummy_prefix="false" remove_extra_whitespaces="false" escape_whitespaces="false" normalization_form="nfc" case_fold="false" nmt="false" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="U8">
					<dim>-1</dim>
				</port>
				<port id="3" precision="BOOL">
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="5" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="6" precision="U8">
					<dim>-1</dim>
				</port>
				<port id="7" precision="BOOL">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Constant_91647" type="Const" version="opset1">
			<data element_type="u8" shape="110" offset="460" size="110" />
			<output>
				<port id="0" precision="U8">
					<dim>110</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="RegexSplit_91648" type="RegexSplit" version="extension">
			<data behaviour="isolate" invert="false" max_splits="-1" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="3" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="4" precision="U8">
					<dim>-1</dim>
				</port>
				<port id="5" precision="BOOL">
					<dim>-1</dim>
				</port>
				<port id="6" precision="U8">
					<dim>110</dim>
				</port>
			</input>
			<output>
				<port id="7" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="8" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="9" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="10" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="11" precision="U8">
					<dim>-1</dim>
				</port>
				<port id="12" precision="BOOL">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Constant_91650" type="Const" version="opset1">
			<data element_type="i32" shape="151665" offset="570" size="606660" />
			<output>
				<port id="0" precision="I32">
					<dim>151665</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Constant_91652" type="Const" version="opset1">
			<data element_type="i32" shape="151665" offset="607230" size="606660" />
			<output>
				<port id="0" precision="I32">
					<dim>151665</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Constant_91654" type="Const" version="opset1">
			<data element_type="u8" shape="976263" offset="1213890" size="976263" />
			<output>
				<port id="0" precision="U8">
					<dim>976263</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Constant_91662" type="Const" version="opset1">
			<data element_type="i32" shape="151387" offset="2190153" size="605548" />
			<output>
				<port id="0" precision="I32">
					<dim>151387</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Constant_91664" type="Const" version="opset1">
			<data element_type="i32" shape="151387" offset="2795701" size="605548" />
			<output>
				<port id="0" precision="I32">
					<dim>151387</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Constant_91666" type="Const" version="opset1">
			<data element_type="u8" shape="491359" offset="3401249" size="491359" />
			<output>
				<port id="0" precision="U8">
					<dim>491359</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Constant_91668" type="Const" version="opset1">
			<data element_type="i32" shape="151387" offset="3892608" size="605548" />
			<output>
				<port id="0" precision="I32">
					<dim>151387</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Constant_91670" type="Const" version="opset1">
			<data element_type="i32" shape="151387" offset="4498156" size="605548" />
			<output>
				<port id="0" precision="I32">
					<dim>151387</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Constant_91672" type="Const" version="opset1">
			<data element_type="u8" shape="484354" offset="5103704" size="484354" />
			<output>
				<port id="0" precision="U8">
					<dim>484354</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Constant_91656" type="Const" version="opset1">
			<data element_type="i32" shape="22" offset="5588058" size="88" />
			<output>
				<port id="0" precision="I32">
					<dim>22</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Constant_91658" type="Const" version="opset1">
			<data element_type="i32" shape="22" offset="5588146" size="88" />
			<output>
				<port id="0" precision="I32">
					<dim>22</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Constant_91660" type="Const" version="opset1">
			<data element_type="u8" shape="294" offset="5588234" size="294" />
			<output>
				<port id="0" precision="U8">
					<dim>294</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Constant_91673" type="Const" version="opset1">
			<data element_type="i32" shape="22" offset="5588528" size="88" />
			<output>
				<port id="0" precision="I32">
					<dim>22</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="BPETokenizer_91674" type="BPETokenizer" version="extension">
			<data unk_token="" fuse_unk="false" suffix_indicator="" end_suffix="" byte_fallback="false" cache_capacity="30328" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="3" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="4" precision="U8">
					<dim>-1</dim>
				</port>
				<port id="5" precision="I32">
					<dim>151665</dim>
				</port>
				<port id="6" precision="I32">
					<dim>151665</dim>
				</port>
				<port id="7" precision="U8">
					<dim>976263</dim>
				</port>
				<port id="8" precision="I32">
					<dim>151387</dim>
				</port>
				<port id="9" precision="I32">
					<dim>151387</dim>
				</port>
				<port id="10" precision="U8">
					<dim>491359</dim>
				</port>
				<port id="11" precision="I32">
					<dim>151387</dim>
				</port>
				<port id="12" precision="I32">
					<dim>151387</dim>
				</port>
				<port id="13" precision="U8">
					<dim>484354</dim>
				</port>
				<port id="14" precision="I32">
					<dim>22</dim>
				</port>
				<port id="15" precision="I32">
					<dim>22</dim>
				</port>
				<port id="16" precision="U8">
					<dim>294</dim>
				</port>
				<port id="17" precision="I32">
					<dim>22</dim>
				</port>
			</input>
			<output>
				<port id="18" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="19" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="20" precision="I32">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Constant_91675" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="5588616" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="34" name="Constant_91677" type="Const" version="opset1">
			<data element_type="u8" shape="4" offset="5588620" size="4" />
			<output>
				<port id="0" precision="U8">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Constant_91679" type="Const" version="opset1">
			<data element_type="u8" shape="13" offset="5588624" size="13" />
			<output>
				<port id="0" precision="U8">
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Truncate_91680" type="Truncate" version="extension">
			<data m_num_inputs="1" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="3" precision="I32" />
				<port id="4" precision="U8">
					<dim>4</dim>
				</port>
				<port id="5" precision="U8">
					<dim>13</dim>
				</port>
			</input>
			<output>
				<port id="6" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="7" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="8" precision="I32">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="Subtract_91681" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Constant_91682" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="5588637" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="39" name="ReduceMax_91683" type="ReduceMax" version="opset1">
			<data keep_dims="false" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32" />
			</input>
			<output>
				<port id="2" precision="I32" />
			</output>
		</layer>
		<layer id="40" name="Constant_91684" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="5588641" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="41" name="RaggedToDense_91685" type="RaggedToDense" version="extension">
			<data pad_right="false" m_pad_max_length="false" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="3" precision="I32" />
				<port id="4" precision="I32" />
			</input>
			<output>
				<port id="5" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="6" precision="BOOL">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Convert_91686" type="Convert" version="opset1">
			<data destination_type="i32" />
			<input>
				<port id="0" precision="BOOL">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Convert_91686.0" type="Convert" version="opset1">
			<data destination_type="i64" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="attention_mask">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="RaggedToDense_91685.0" type="Convert" version="opset1">
			<data destination_type="i64" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="input_ids">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Result_91687" type="Result" version="opset1" output_names="input_ids">
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
		</layer>
		<layer id="44" name="Result_91688" type="Result" version="opset1" output_names="attention_mask">
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="2" to-port="0" />
		<edge from-layer="1" from-port="0" to-layer="8" to-port="0" />
		<edge from-layer="2" from-port="1" to-layer="3" to-port="0" />
		<edge from-layer="2" from-port="3" to-layer="15" to-port="4" />
		<edge from-layer="2" from-port="2" to-layer="15" to-port="3" />
		<edge from-layer="2" from-port="1" to-layer="15" to-port="2" />
		<edge from-layer="3" from-port="1" to-layer="6" to-port="0" />
		<edge from-layer="4" from-port="0" to-layer="6" to-port="1" />
		<edge from-layer="5" from-port="0" to-layer="6" to-port="2" />
		<edge from-layer="6" from-port="3" to-layer="11" to-port="0" />
		<edge from-layer="6" from-port="3" to-layer="8" to-port="1" />
		<edge from-layer="7" from-port="0" to-layer="8" to-port="2" />
		<edge from-layer="8" from-port="3" to-layer="15" to-port="0" />
		<edge from-layer="9" from-port="0" to-layer="13" to-port="0" />
		<edge from-layer="10" from-port="0" to-layer="11" to-port="1" />
		<edge from-layer="11" from-port="2" to-layer="13" to-port="1" />
		<edge from-layer="12" from-port="0" to-layer="13" to-port="2" />
		<edge from-layer="13" from-port="3" to-layer="15" to-port="1" />
		<edge from-layer="14" from-port="0" to-layer="15" to-port="5" />
		<edge from-layer="15" from-port="8" to-layer="16" to-port="0" />
		<edge from-layer="15" from-port="7" to-layer="18" to-port="1" />
		<edge from-layer="15" from-port="6" to-layer="18" to-port="0" />
		<edge from-layer="15" from-port="11" to-layer="16" to-port="3" />
		<edge from-layer="15" from-port="10" to-layer="16" to-port="2" />
		<edge from-layer="15" from-port="9" to-layer="16" to-port="1" />
		<edge from-layer="16" from-port="4" to-layer="18" to-port="2" />
		<edge from-layer="16" from-port="5" to-layer="18" to-port="3" />
		<edge from-layer="16" from-port="6" to-layer="18" to-port="4" />
		<edge from-layer="16" from-port="7" to-layer="18" to-port="5" />
		<edge from-layer="17" from-port="0" to-layer="18" to-port="6" />
		<edge from-layer="18" from-port="11" to-layer="32" to-port="4" />
		<edge from-layer="18" from-port="10" to-layer="32" to-port="3" />
		<edge from-layer="18" from-port="8" to-layer="32" to-port="1" />
		<edge from-layer="18" from-port="9" to-layer="32" to-port="2" />
		<edge from-layer="18" from-port="7" to-layer="32" to-port="0" />
		<edge from-layer="19" from-port="0" to-layer="32" to-port="5" />
		<edge from-layer="20" from-port="0" to-layer="32" to-port="6" />
		<edge from-layer="21" from-port="0" to-layer="32" to-port="7" />
		<edge from-layer="22" from-port="0" to-layer="32" to-port="8" />
		<edge from-layer="23" from-port="0" to-layer="32" to-port="9" />
		<edge from-layer="24" from-port="0" to-layer="32" to-port="10" />
		<edge from-layer="25" from-port="0" to-layer="32" to-port="11" />
		<edge from-layer="26" from-port="0" to-layer="32" to-port="12" />
		<edge from-layer="27" from-port="0" to-layer="32" to-port="13" />
		<edge from-layer="28" from-port="0" to-layer="32" to-port="14" />
		<edge from-layer="29" from-port="0" to-layer="32" to-port="15" />
		<edge from-layer="30" from-port="0" to-layer="32" to-port="16" />
		<edge from-layer="31" from-port="0" to-layer="32" to-port="17" />
		<edge from-layer="32" from-port="20" to-layer="36" to-port="2" />
		<edge from-layer="32" from-port="18" to-layer="36" to-port="0" />
		<edge from-layer="32" from-port="19" to-layer="36" to-port="1" />
		<edge from-layer="33" from-port="0" to-layer="36" to-port="3" />
		<edge from-layer="34" from-port="0" to-layer="36" to-port="4" />
		<edge from-layer="35" from-port="0" to-layer="36" to-port="5" />
		<edge from-layer="36" from-port="6" to-layer="41" to-port="0" />
		<edge from-layer="36" from-port="8" to-layer="41" to-port="2" />
		<edge from-layer="36" from-port="7" to-layer="41" to-port="1" />
		<edge from-layer="36" from-port="6" to-layer="37" to-port="1" />
		<edge from-layer="36" from-port="7" to-layer="37" to-port="0" />
		<edge from-layer="37" from-port="2" to-layer="39" to-port="0" />
		<edge from-layer="38" from-port="0" to-layer="39" to-port="1" />
		<edge from-layer="39" from-port="2" to-layer="41" to-port="3" />
		<edge from-layer="40" from-port="0" to-layer="41" to-port="4" />
		<edge from-layer="41" from-port="6" to-layer="42" to-port="0" />
		<edge from-layer="41" from-port="5" to-layer="45" to-port="0" />
		<edge from-layer="42" from-port="1" to-layer="43" to-port="0" />
		<edge from-layer="43" from-port="1" to-layer="44" to-port="0" />
		<edge from-layer="45" from-port="1" to-layer="46" to-port="0" />
	</edges>
	<rt_info>
		<add_attention_mask value="True" />
		<add_prefix_space />
		<add_special_tokens value="True" />
		<chat_template value="{%- if tools %}&#10;    {{- '&lt;|im_start|>system\n' }}&#10;    {%- if messages[0]['role'] == 'system' %}&#10;        {{- messages[0]['content'] }}&#10;    {%- else %}&#10;        {{- 'You are Qwen, created by Alibaba Cloud. You are a helpful assistant.' }}&#10;    {%- endif %}&#10;    {{- &quot;\n\n# Tools\n\nYou may call one or more functions to assist with the user query.\n\nYou are provided with function signatures within &lt;tools>&lt;/tools> XML tags:\n&lt;tools>&quot; }}&#10;    {%- for tool in tools %}&#10;        {{- &quot;\n&quot; }}&#10;        {{- tool | tojson }}&#10;    {%- endfor %}&#10;    {{- &quot;\n&lt;/tools>\n\nFor each function call, return a json object with function name and arguments within &lt;tool_call>&lt;/tool_call> XML tags:\n&lt;tool_call>\n{\&quot;name\&quot;: &lt;function-name>, \&quot;arguments\&quot;: &lt;args-json-object>}\n&lt;/tool_call>&lt;|im_end|>\n&quot; }}&#10;{%- else %}&#10;    {%- if messages[0]['role'] == 'system' %}&#10;        {{- '&lt;|im_start|>system\n' + messages[0]['content'] + '&lt;|im_end|>\n' }}&#10;    {%- else %}&#10;        {{- '&lt;|im_start|>system\nYou are Qwen, created by Alibaba Cloud. You are a helpful assistant.&lt;|im_end|>\n' }}&#10;    {%- endif %}&#10;{%- endif %}&#10;{%- for message in messages %}&#10;    {%- if (message.role == &quot;user&quot;) or (message.role == &quot;system&quot; and not loop.first) or (message.role == &quot;assistant&quot; and not message.tool_calls) %}&#10;        {{- '&lt;|im_start|>' + message.role + '\n' + message.content + '&lt;|im_end|>' + '\n' }}&#10;    {%- elif message.role == &quot;assistant&quot; %}&#10;        {{- '&lt;|im_start|>' + message.role }}&#10;        {%- if message.content %}&#10;            {{- '\n' + message.content }}&#10;        {%- endif %}&#10;        {%- for tool_call in message.tool_calls %}&#10;            {%- if tool_call.function is defined %}&#10;                {%- set tool_call = tool_call.function %}&#10;            {%- endif %}&#10;            {{- '\n&lt;tool_call>\n{&quot;name&quot;: &quot;' }}&#10;            {{- tool_call.name }}&#10;            {{- '&quot;, &quot;arguments&quot;: ' }}&#10;            {{- tool_call.arguments | tojson }}&#10;            {{- '}\n&lt;/tool_call>' }}&#10;        {%- endfor %}&#10;        {{- '&lt;|im_end|>\n' }}&#10;    {%- elif message.role == &quot;tool&quot; %}&#10;        {%- if (loop.index0 == 0) or (messages[loop.index0 - 1].role != &quot;tool&quot;) %}&#10;            {{- '&lt;|im_start|>user' }}&#10;        {%- endif %}&#10;        {{- '\n&lt;tool_response>\n' }}&#10;        {{- message.content }}&#10;        {{- '\n&lt;/tool_response>' }}&#10;        {%- if loop.last or (messages[loop.index0 + 1].role != &quot;tool&quot;) %}&#10;            {{- '&lt;|im_end|>\n' }}&#10;        {%- endif %}&#10;    {%- endif %}&#10;{%- endfor %}&#10;{%- if add_generation_prompt %}&#10;    {{- '&lt;|im_start|>assistant\n' }}&#10;{%- endif %}&#10;" />
		<clean_up_tokenization_spaces />
		<detokenizer_input_type value="i64" />
		<eos_token_id value="151645" />
		<handle_special_tokens_with_re />
		<max_length />
		<number_of_inputs value="1" />
		<openvino_tokenizers_version value="2025.2.0.1-567-7885335c24b" />
		<openvino_version value="2025.2.0-19140-c01cd93e24d-releases/2025/2" />
		<original_post_processor_template value="{&quot;type&quot;: &quot;ByteLevel&quot;, &quot;add_prefix_space&quot;: false, &quot;trim_offsets&quot;: false, &quot;use_regex&quot;: false}" />
		<original_tokenizer_class value="&lt;class 'transformers.models.qwen2.tokenization_qwen2_fast.Qwen2TokenizerFast'>" />
		<pad_token_id value="151643" />
		<sentencepiece_version value="0.2.1" />
		<skip_special_tokens value="True" />
		<streaming_detokenizer value="False" />
		<tiktoken_version value="0.9.0" />
		<tokenizer_output_type value="i64" />
		<tokenizers_version value="0.21.4" />
		<transformers_version value="4.51.3" />
		<use_max_padding value="False" />
		<use_sentencepiece_backend value="False" />
		<utf8_replace_mode value="replace" />
		<with_detokenizer value="True" />
	</rt_info>
</net>
