<?xml version="1.0"?>
<net name="Model0" version="11">
	<layers>
		<layer id="3" name="input_ids" type="Parameter" version="opset1">
			<data shape="?,?" element_type="i64" />
			<output>
				<port id="0" precision="I64" names="input_ids">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="attention_mask" type="Parameter" version="opset1">
			<data shape="?,?" element_type="i64" />
			<output>
				<port id="0" precision="I64" names="attention_mask">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="position_ids" type="Parameter" version="opset1">
			<data shape="?,?" element_type="i64" />
			<output>
				<port id="0" precision="I64" names="position_ids">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="0" name="beam_idx" type="Parameter" version="opset1">
			<data shape="?" element_type="i32" />
			<output>
				<port id="0" precision="I32" names="beam_idx">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Constant_85764" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="5" name="ShapeOf_85750" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Constant_85752" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="4" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Constant_85754" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="4" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="8" name="Gather_85755" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Constant_85757" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="12" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Constant_85759" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="4" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Constant_85761" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="20" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Concat_85762" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Broadcast_85765" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>0</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="ReadValue_85410" type="ReadValue" version="opset6">
			<data variable_id="past_key_values.9.valuepresent.9.value" variable_type="f32" variable_shape="?,2,?,128" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>0</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="past_key_values.9.value">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Constant_84852" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="4" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="16" name="Gather_84853" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Constant_75315" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1536" offset="28" size="6144" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1536</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="self.model.embed_tokens.weight" type="Const" version="opset1">
			<data element_type="u8" shape="151936, 1536" offset="6172" size="233373696" />
			<output>
				<port id="0" precision="U8">
					<dim>151936</dim>
					<dim>1536</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Convert_105967" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>151936</dim>
					<dim>1536</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>151936</dim>
					<dim>1536</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="self.model.embed_tokens.weight/zero_point" type="Const" version="opset1">
			<data element_type="u8" shape="151936, 1" offset="233379868" size="151936" />
			<output>
				<port id="0" precision="U8">
					<dim>151936</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Convert_105970" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>151936</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>151936</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="self.model.embed_tokens.weight/zero_point/subtract" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>151936</dim>
					<dim>1536</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>151936</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>151936</dim>
					<dim>1536</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="self.model.embed_tokens.weight/scale" type="Const" version="opset1">
			<data element_type="f16" shape="151936, 1" offset="233531804" size="303872" />
			<output>
				<port id="0" precision="FP16">
					<dim>151936</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="self.model.embed_tokens.weight/fq_weights_0" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>151936</dim>
					<dim>1536</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>151936</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>151936</dim>
					<dim>1536</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="__module.model.embed_tokens/ov_ext::embedding/Convert" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>151936</dim>
					<dim>1536</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>151936</dim>
					<dim>1536</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="__module.model.embed_tokens/ov_ext::embedding/Convert_1" type="Convert" version="opset1">
			<data destination_type="i32" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="__module.model.embed_tokens/ov_ext::embedding/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="28" name="__module.model.embed_tokens/ov_ext::embedding/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>151936</dim>
					<dim>1536</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="FP32" names="286,372,383,hidden_states.1,inputs_embeds">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1536</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Constant_75240" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1536" offset="233835676" size="6144" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1536</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Constant_75239" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="233841820" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Constant_75237" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="233841824" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="__module.model.layers.0.input_layernorm/aten::pow/Power" type="Power" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1536</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="373">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1536</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Constant_566" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="233841828" size="8" />
			<output>
				<port id="0" precision="I64" names="374">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="__module.model.layers.0.input_layernorm/aten::mean/ReduceMean" type="ReduceMean" version="opset1">
			<data keep_dims="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1536</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="375,variance.1">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Constant_75238" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="233841836" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="__module.model.layers.0.input_layernorm/aten::add/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="376">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="__module.model.layers.0.input_layernorm/aten::rsqrt/Sqrt" type="Sqrt" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="__module.model.layers.0.input_layernorm/aten::rsqrt/Divide" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="377">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="__module.model.layers.0.input_layernorm/aten::mul/Multiply" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1536</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="378,379,hidden_states.3,hidden_states.5">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1536</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="__module.model.layers.0.input_layernorm/aten::mul/Multiply_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1536</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1536</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="380,382,hidden_states.7">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1536</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="self.model.layers.0.self_attn.q_proj.weight" type="Const" version="opset1">
			<data element_type="u4" shape="1536, 12, 128" offset="233841840" size="1179648" />
			<output>
				<port id="0" precision="U4">
					<dim>1536</dim>
					<dim>12</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Convert_541510" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U4">
					<dim>1536</dim>
					<dim>12</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1536</dim>
					<dim>12</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="self.model.layers.0.self_attn.q_proj.weight/zero_point" type="Const" version="opset1">
			<data element_type="u4" shape="1536, 12, 1" offset="235021488" size="9216" />
			<output>
				<port id="0" precision="U4">
					<dim>1536</dim>
					<dim>12</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Convert_541513" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U4">
					<dim>1536</dim>
					<dim>12</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1536</dim>
					<dim>12</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="self.model.layers.0.self_attn.q_proj.weight/zero_point/subtract" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>1536</dim>
					<dim>12</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1536</dim>
					<dim>12</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1536</dim>
					<dim>12</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="self.model.layers.0.self_attn.q_proj.weight/scale" type="Const" version="opset1">
			<data element_type="f16" shape="1536, 12, 1" offset="235030704" size="36864" />
			<output>
				<port id="0" precision="FP16">
					<dim>1536</dim>
					<dim>12</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="self.model.layers.0.self_attn.q_proj.weight/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>1536</dim>
					<dim>12</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1536</dim>
					<dim>12</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1536</dim>
					<dim>12</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Constant_541518" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="235067568" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Reshape_541519" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP16">
					<dim>1536</dim>
					<dim>12</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1536</dim>
					<dim>1536</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="__module.model.layers.0.self_attn.q_proj/ov_ext::linear/Convert" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1536</dim>
					<dim>1536</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1536</dim>
					<dim>1536</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="__module.model.layers.0.self_attn.q_proj/ov_ext::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1536</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1536</dim>
					<dim>1536</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1536</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="self.model.layers.0.self_attn.q_proj.bias" type="Const" version="opset1">
			<data element_type="bf16" shape="1536" offset="235067584" size="3072" />
			<output>
				<port id="0" precision="BF16" names="self.model.layers.0.self_attn.q_proj.bias">
					<dim>1536</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="__module.model.layers.0.self_attn.q_proj/ov_ext::linear/Convert_1" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="BF16">
					<dim>1536</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1536</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="__module.model.layers.0.self_attn.q_proj/ov_ext::linear/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1536</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1536</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="392">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1536</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Constant_83520" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="235070656" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="__module.model.layers.0.self_attn/aten::view/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1536</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="394">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>12</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="__module.model.layers.0.self_attn/aten::transpose/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="4" offset="235070688" size="16" />
			<output>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="__module.model.layers.0.self_attn/aten::transpose/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>12</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="395,q.1">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="__module.model.rotary_emb/aten::to/Convert" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1" offset="235070704" size="256" />
			<output>
				<port id="0" precision="FP32" names="343">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="ShapeOf_76960" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1536</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Constant_76961" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="4" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Constant_76962" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="4" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="63" name="Gather_76963" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="1093,1109,1254,1270,1415,1431,1576,1592,1737,1753,1898,1914,2059,2075,2220,2236,2381,2397,2542,2558,2703,2719,2864,2880,296,3025,3041,3186,3202,3347,3363,344,3508,3524,3669,3685,3830,3846,3991,4007,4152,4168,4313,4329,4474,449,4490,4635,465,4651,4796,4812,610,626,771,787,932,948">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Constant_58581" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="235070960" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Constant_58583" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="235070960" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="__module.model.rotary_emb/prim::ListConstruct" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="__module.model.rotary_emb/aten::expand/Broadcast" type="Broadcast" version="opset3">
			<data mode="bidirectional" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="346,347,352,inv_freq_expanded,inv_freq_expanded.1">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="224" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="235070960" size="8" />
			<output>
				<port id="0" precision="I64" names="224" />
			</output>
		</layer>
		<layer id="69" name="__module.model.rotary_emb/aten::unsqueeze/Unsqueeze_2" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="349,350">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="__module.model.rotary_emb/aten::to/Convert_3" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="351,353,position_ids_expanded,position_ids_expanded.1">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="__module.model.rotary_emb/aten::matmul/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="354">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="__module.model.rotary_emb/aten::transpose/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="235070968" size="12" />
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="__module.model.rotary_emb/aten::transpose/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="355">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="__module.model.rotary_emb/aten::cat/Concat" type="Concat" version="opset1">
			<data axis="-1" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="357,emb">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="__module.model.rotary_emb/aten::cos/Cos" type="Cos" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="358,359,362,365,cos.1,cos.3">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="__module.model.layers.0.self_attn/aten::unsqueeze/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="FP32" names="1055,1216,1377,1538,1699,1860,2021,2182,2343,2504,2665,2826,2987,3148,3309,3470,3631,3792,3953,408,4114,4275,4436,4597,4758,572,733,894,cos,cos.11,cos.13,cos.15,cos.17,cos.19,cos.21,cos.23,cos.25,cos.27,cos.29,cos.31,cos.33,cos.35,cos.37,cos.39,cos.41,cos.43,cos.45,cos.47,cos.49,cos.5,cos.51,cos.53,cos.55,cos.57,cos.7,cos.9">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="__module.model.layers.0.self_attn/aten::mul/Multiply" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="410">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Constant_880" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="235070980" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Constant_882" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="235070988" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Constant_884" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="235070960" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Constant_836" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="235070996" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="__module.model.layers.0.self_attn/aten::slice/Slice" type="Slice" version="opset8">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="420,x2.1">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="__module.model.layers.0.self_attn/aten::neg/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="235071004" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="84" name="__module.model.layers.0.self_attn/aten::neg/ConvertLike" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I32" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="85" name="__module.model.layers.0.self_attn/aten::neg/Multiply" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32" names="421">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Constant_777" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="4" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Constant_821" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="235070980" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="Constant_823" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="235070960" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Constant_775" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="235070996" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="__module.model.layers.0.self_attn/aten::slice/Slice_1" type="Slice" version="opset8">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="415">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="__module.model.layers.0.self_attn/aten::cat/Concat" type="Concat" version="opset1">
			<data axis="-1" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="423">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="__module.model.rotary_emb/aten::sin/Sin" type="Sin" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="360,361,363,366,sin.1,sin.3">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="__module.model.layers.0.self_attn/aten::unsqueeze/Unsqueeze_1" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="FP32" names="1056,1217,1378,1539,1700,1861,2022,2183,2344,2505,2666,2827,2988,3149,3310,3471,3632,3793,3954,409,4115,4276,4437,4598,4759,573,734,895,sin,sin.11,sin.13,sin.15,sin.17,sin.19,sin.21,sin.23,sin.25,sin.27,sin.29,sin.31,sin.33,sin.35,sin.37,sin.39,sin.41,sin.43,sin.45,sin.47,sin.49,sin.5,sin.51,sin.53,sin.55,sin.57,sin.7,sin.9">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="__module.model.layers.0.self_attn/aten::mul/Multiply_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="424">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="__module.model.layers.0.self_attn/aten::add/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="425,query.1">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Constant_85776" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="97" name="Constant_85769" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="12" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="Constant_85771" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="4" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="Constant_85773" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="20" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="Concat_85774" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="Broadcast_85777" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>0</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="ReadValue_85300" type="ReadValue" version="opset6">
			<data variable_id="past_key_values.0.keypresent.0.key" variable_type="f32" variable_shape="?,2,?,128" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>0</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="past_key_values.0.key">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="Constant_84795" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="4" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="104" name="Gather_84796" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="self.model.layers.0.self_attn.k_proj.weight" type="Const" version="opset1">
			<data element_type="u4" shape="256, 12, 128" offset="235071008" size="196608" />
			<output>
				<port id="0" precision="U4">
					<dim>256</dim>
					<dim>12</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="Convert_827166" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U4">
					<dim>256</dim>
					<dim>12</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>256</dim>
					<dim>12</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="self.model.layers.0.self_attn.k_proj.weight/zero_point" type="Const" version="opset1">
			<data element_type="u4" shape="256, 12, 1" offset="235267616" size="1536" />
			<output>
				<port id="0" precision="U4">
					<dim>256</dim>
					<dim>12</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="Convert_827169" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U4">
					<dim>256</dim>
					<dim>12</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>256</dim>
					<dim>12</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="self.model.layers.0.self_attn.k_proj.weight/zero_point/subtract" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>256</dim>
					<dim>12</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>256</dim>
					<dim>12</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>256</dim>
					<dim>12</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="self.model.layers.0.self_attn.k_proj.weight/scale" type="Const" version="opset1">
			<data element_type="f16" shape="256, 12, 1" offset="235269152" size="6144" />
			<output>
				<port id="0" precision="FP16">
					<dim>256</dim>
					<dim>12</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="self.model.layers.0.self_attn.k_proj.weight/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>256</dim>
					<dim>12</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>256</dim>
					<dim>12</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>256</dim>
					<dim>12</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="Constant_827174" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="235275296" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="Reshape_827175" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP16">
					<dim>256</dim>
					<dim>12</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>256</dim>
					<dim>1536</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="__module.model.layers.0.self_attn.k_proj/ov_ext::linear/Convert" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>256</dim>
					<dim>1536</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>1536</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="__module.model.layers.0.self_attn.k_proj/ov_ext::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1536</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>1536</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="self.model.layers.0.self_attn.k_proj.bias" type="Const" version="opset1">
			<data element_type="bf16" shape="256" offset="235275312" size="512" />
			<output>
				<port id="0" precision="BF16" names="self.model.layers.0.self_attn.k_proj.bias">
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="__module.model.layers.0.self_attn.k_proj/ov_ext::linear/Convert_1" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="BF16">
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="__module.model.layers.0.self_attn.k_proj/ov_ext::linear/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="398">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="Constant_83521" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="235275824" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="__module.model.layers.0.self_attn/aten::view/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="400">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="__module.model.layers.0.self_attn/aten::transpose/Constant_1" type="Const" version="opset1">
			<data element_type="i32" shape="4" offset="235070688" size="16" />
			<output>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="__module.model.layers.0.self_attn/aten::transpose/Transpose_1" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="401,k.1">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="__module.model.layers.0.self_attn/aten::mul/Multiply_2" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="426">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="124" name="Constant_1023" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="235070980" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="125" name="Constant_1025" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="235070988" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="126" name="Constant_1027" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="235070960" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="127" name="Constant_979" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="235070996" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="128" name="__module.model.layers.0.self_attn/aten::slice/Slice_2" type="Slice" version="opset8">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="436,x2.3">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="129" name="__module.model.layers.0.self_attn/aten::neg/Constant_1" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="235071004" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="130" name="__module.model.layers.0.self_attn/aten::neg/ConvertLike_1" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I32" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="131" name="__module.model.layers.0.self_attn/aten::neg/Multiply_1" type="Multiply" version="opset1">
